In [43]:
#1. Import the necessary libraries
import pandas as pd

In [44]:
#2. Import the dataset from this address.
#3. Assign it to a variable called baby_names.

baby_names=pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")

In [45]:
#4. See the first 10 entries
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [46]:
# 5. Delete the column 'Unnamed: 0' and 'Id'
del baby_names['Unnamed: 0']
del baby_names['Id']

In [47]:
#6. Is there more male or female names in the dataset?
baby_names.Gender.value_counts().idxmax()

'F'

In [48]:
#7. Group the dataset by name and assign to names

del baby_names["Year"]
names = baby_names.groupby("Name").sum()
names.head()
print(names.shape)
names.sort_values("Count", ascending = 0).head()

(17632, 1)

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

In [58]:
 #8. How many different names exist in the dataset?
len(names)

17632

In [68]:
#9. What is the name with most occurrences?

names.Count.idxmax()

'Jacob'

In [74]:
#10. How many different names have the least occurrences?
len(names[names.Count == names.Count.min()])

2578

In [75]:
# 11. What is the median name occurrence?
names[names.Count == names.Count.median()]

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49
...        ...
Sriram      49
Trinton     49
Vita        49
Yoni        49
Zuleima     49

[66 rows x 1 columns]

In [77]:
#12. What is the standard deviation of names?
names.std()

Count    11006.069468
dtype: float64

In [78]:
#13. Get a summary with the mean, min, max, std and quartiles.
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000